added architechture
